#+BEGIN: clocktable :scope file :maxlevel 2
#+CAPTION: Clock summary at [2021-02-11 jue 19:42]
| Headline         | Time    |       |
|------------------+---------+-------|
| *Total time*     | *23:54* |       |
|------------------+---------+-------|
| Agenda hard-work | 23:54   |       |
| \_  Enero 2021   |         |  8:39 |
| \_  Febrero 2021 |         | 15:15 |
#+END:


* Agenda hard-work
** Enero 2021
*** [2021-01-25 lun]
    :LOGBOOK:
    CLOCK: [2021-01-25 lun 16:11]--[2021-01-25 lun 16:57] =>  0:46
    introduccion informal python
    :END:
*** [2021-01-26 mar]
    :LOGBOOK:
    CLOCK: [2021-01-26 mar 17:40]--[2021-01-26 mar 18:25] =>  0:45
    funciones- instalo Spyder para pruebas mejoradas 
    CLOCK: [2021-01-26 mar 10:32]--[2021-01-26 mar 11:32] =>  1:00
    control de flujo - sentencia for(else) - 
    :END:
*** [2021-01-27 mié]
    :LOGBOOK:
    CLOCK: [2021-01-27 mié 18:04]--[2021-01-27 mié 19:09] =>  1:05
    funciones 
    :END:
*** [2021-01-28 jue]
    :LOGBOOK:
    CLOCK: [2021-01-28 jue 17:42]--[2021-01-28 jue 18:05] =>  0:23
    list methods
    :END:
*** [2021-01-29 vie]
    :LOGBOOK:
    CLOCK: [2021-01-29 vie 10:57]--[2021-01-29 vie 12:04] =>  1:07
    sorted / lifo-fifo / comprension de listas
    :END:
*** [2021-01-30 sáb]
    :LOGBOOK:
    CLOCK: [2021-01-30 sáb 20:14]--[2021-01-30 sáb 20:55] =>  0:41
    CLOCK: [2021-01-30 sáb 14:54]--[2021-01-30 sáb 15:17] =>  0:23
    tuplas - conjuntos
    :END:
*** [2021-01-31 dom]
    :LOGBOOK:
    CLOCK: [2021-01-31 dom 19:25]--[2021-01-31 dom 20:35] =>  1:10
    inmersion 2.1-2.4
    CLOCK: [2021-01-31 dom 15:45]--[2021-01-31 dom 16:28] =>  0:43
    inmersion 1.3-1.10
    CLOCK: [2021-01-31 dom 14:15]--[2021-01-31 dom 14:51] =>  0:36
    inmersion 1.1-1.2
    :END:
** Febrero 2021
*** [2021-02-01 lun]
    :LOGBOOK:
    CLOCK: [2021-02-01 lun 20:02]--[2021-02-01 lun 20:54] =>  0:52
    4.1-4.4
    CLOCK: [2021-02-01 lun 17:56]--[2021-02-01 lun 19:02] =>  1:06
    inmersion 3.1-3.3
    CLOCK: [2021-02-01 lun 11:50]--[2021-02-01 lun 12:47] =>  0:57
    inmersion 2.5-2.6
    :END:
*** [2021-02-02 mar]
    :LOGBOOK:
    CLOCK: [2021-02-02 mar 20:34]--[2021-02-02 mar 20:58] =>  0:24
    6.1-6.2
    CLOCK: [2021-02-02 mar 16:36]--[2021-02-02 mar 17:27] =>  0:51
    5.3-5.7
    CLOCK: [2021-02-02 mar 11:48]--[2021-02-02 mar 12:51] =>  1:03
    4.5-4.7 5.1-5.2
    :END:
*** [2021-02-04 jue]
    :LOGBOOK:
    CLOCK: [2021-02-04 jue 19:15]--[2021-02-04 jue 20:05] =>  0:50
    nivel 32 - reto 6-8
    CLOCK: [2021-02-04 jue 12:44]--[2021-02-04 jue 13:14] =>  0:30
    CLOCK: [2021-02-04 jue 12:08]--[2021-02-04 jue 12:34] =>  0:26
    CLOCK: [2021-02-04 jue 11:44]--[2021-02-04 jue 11:57] =>  0:13
    nivel 32 - reto 1-5
    :END:
*** [2021-02-05 vie]
    :LOGBOOK:
    CLOCK: [2021-02-05 vie 17:04]--[2021-02-05 vie 17:59] =>  0:55
    nivel 32 - reto 11-13
    CLOCK: [2021-02-05 vie 12:36]--[2021-02-05 vie 13:29] =>  0:53
    Nivel 32 - reto 9-10
    :END:
*** [2021-02-09 mar]
    :LOGBOOK:
    CLOCK: [2021-02-09 mar 20:48]--[2021-02-09 mar 21:07] =>  0:19
    practica algoritmo de seleccion
    CLOCK: [2021-02-09 mar 20:11]--[2021-02-09 mar 20:43] =>  0:32
    nivel 31 - reto 1-2
    CLOCK: [2021-02-09 mar 18:28]--[2021-02-09 mar 19:10] =>  0:42
    nivel 32 - reto 19-21
    CLOCK: [2021-02-09 mar 10:49]--[2021-02-09 mar 12:03] =>  1:14
    nivel 32 - reto 14-19 parte
    :END:
*** [2021-02-10 mié]
    :LOGBOOK:
    CLOCK: [2021-02-10 mié 19:33]--[2021-02-10 mié 20:11] =>  0:38
    nivel 31 - reto 5-6
    CLOCK: [2021-02-10 mié 11:59]--[2021-02-10 mié 12:33] =>  0:34
    nivel 31 - reto 3-4
    :END:
*** [2021-02-11 jue]
    :LOGBOOK:
    CLOCK: [2021-02-11 jue 18:58]--[2021-02-11 jue 19:41] =>  0:43
    nivel 30 - reto 5-7
    CLOCK: [2021-02-11 jue 12:06]--[2021-02-11 jue 12:55] =>  0:49
    nivel 30 - reto 1-4
    CLOCK: [2021-02-11 jue 11:02]--[2021-02-11 jue 11:46] =>  0:44
    nivel 31 - reto 7-8
    :END:
